load-test/tests/data/gateway/test-gateway.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">${__P(Loop_count)}</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(Threads_count)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(Ramp_up_period)}</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Init TEST" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">${body}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${serverAddress}</stringProp>
          <stringProp name="HTTPSampler.port">${port}</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">${path}${params}</stringProp>
          <stringProp name="HTTPSampler.method">${method}</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Requests Params CSV Config" enabled="true">
            <stringProp name="delimiter">,</stringProp>
            <stringProp name="filename">request_params_gateway.csv</stringProp>
            <boolProp name="ignoreFirstLine">true</boolProp>
            <boolProp name="quotedData">true</boolProp>
            <boolProp name="recycle">true</boolProp>
            <stringProp name="shareMode">shareMode.group</stringProp>
            <boolProp name="stopThread">false</boolProp>
            <stringProp name="variableNames">testID,label,serverAddress,port,method,path,params,body,cookies,rem_user</stringProp>
          </CSVDataSet>
          <hashTree/>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="${testID}-(${label}-http-manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="User-Agent" elementType="Header">
                <stringProp name="Header.name">User-Agent</stringProp>
                <stringProp name="Header.value">Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:82.0) Gecko/20100101 Firefox/82.0</stringProp>
              </elementProp>
              <elementProp name="Accept" elementType="Header">
                <stringProp name="Header.name">Accept</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="Accept-Language" elementType="Header">
                <stringProp name="Header.name">Accept-Language</stringProp>
                <stringProp name="Header.value">ru-RU,ru;q=0.8,en-US;q=0.5,en;q=0.3</stringProp>
              </elementProp>
              <elementProp name="Accept-Encoding" elementType="Header">
                <stringProp name="Header.name">Accept-Encoding</stringProp>
                <stringProp name="Header.value">gzip, deflate</stringProp>
              </elementProp>
              <elementProp name="OAM_REMOTE_USER_DN" elementType="Header">
                <stringProp name="Header.name">OAM_REMOTE_USER_DN</stringProp>
                <stringProp name="Header.value">=?UTF-8?B?ZG4gZmVkIGFsbA==?=</stringProp>
              </elementProp>
              <elementProp name="OAM_REMOTE_USER_GUID" elementType="Header">
                <stringProp name="Header.name">OAM_REMOTE_USER_GUID</stringProp>
                <stringProp name="Header.value">ZXCZXC</stringProp>
              </elementProp>
              <elementProp name="OAM_REMOTE_USER_SURNAME" elementType="Header">
                <stringProp name="Header.name">OAM_REMOTE_USER_SURNAME</stringProp>
                <stringProp name="Header.value">=?UTF-8?B?0JLRgdC10LzQvtCz0YPRidC40Lk=?=</stringProp>
              </elementProp>
              <elementProp name="OAM_REMOTE_USER_NAME" elementType="Header">
                <stringProp name="Header.name">OAM_REMOTE_USER_NAME</stringProp>
                <stringProp name="Header.value">=?UTF-8?B?0JLQu9Cw0YHRgtC10LvQuNC9?=</stringProp>
              </elementProp>
              <elementProp name="OAM_REMOTE_USER_PATRONUMIC" elementType="Header">
                <stringProp name="Header.name">OAM_REMOTE_USER_PATRONUMIC</stringProp>
                <stringProp name="Header.value">=?UTF-8?B?0J3QktCf0LjQodCS?=</stringProp>
              </elementProp>
              <elementProp name="OAM_REMOTE_USER_TITLE" elementType="Header">
                <stringProp name="Header.name">OAM_REMOTE_USER_TITLE</stringProp>
                <stringProp name="Header.value">=?UTF-8?B?0JLQu9Cw0YHRgtC10LvQuNC9?=</stringProp>
              </elementProp>
              <elementProp name="OAM_REMOTE_USER" elementType="Header">
                <stringProp name="Header.name">OAM_REMOTE_USER</stringProp>
                <stringProp name="Header.value">${rem_user}</stringProp>
              </elementProp>
              <elementProp name="X-User-Timezone" elementType="Header">
                <stringProp name="Header.name">X-User-Timezone</stringProp>
                <stringProp name="Header.value">Europe/Bucharest</stringProp>
              </elementProp>
              <elementProp name="Connection" elementType="Header">
                <stringProp name="Header.name">Connection</stringProp>
                <stringProp name="Header.value">keep-alive</stringProp>
              </elementProp>
              <elementProp name="Referer" elementType="Header">
                <stringProp name="Header.name">Referer</stringProp>
                <stringProp name="Header.value">http://${serverAddress}:${port}/nvpsv/</stringProp>
              </elementProp>
              <elementProp name="Cookie" elementType="Header">
                <stringProp name="Header.name">Cookie</stringProp>
                <stringProp name="Header.value">${cookies}</stringProp>
              </elementProp>
              <elementProp name="Pragma" elementType="Header">
                <stringProp name="Header.name">Pragma</stringProp>
                <stringProp name="Header.value">no-cache</stringProp>
              </elementProp>
              <elementProp name="Cache-Control" elementType="Header">
                <stringProp name="Header.name">Cache-Control</stringProp>
                <stringProp name="Header.value">no-cache</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">./report/GatewaySummaryReport.csv</stringProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">./report/GatewayViewResultsTree.csv</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>